<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Nome da Aplicação
    |--------------------------------------------------------------------------
    */
    'name' => 'LaravelMenuManager',

    /*
    |--------------------------------------------------------------------------
    | Middlewares
    |--------------------------------------------------------------------------
    */
    'middleware' => [],

    /*
    |--------------------------------------------------------------------------
    | Publicar rota para gerenciar (get e post) menus | true ou false
    |--------------------------------------------------------------------------
    */
    'routes_view' => false,
    'routes_post' => false,

    /*
    |--------------------------------------------------------------------------
    | View para gerenciamento dos menus | wmenu::index
    |--------------------------------------------------------------------------
    */
    'blade_view' => 'wmenu::index',

    /*
    |--------------------------------------------------------------------------
    | Prefixo de tabela
    |--------------------------------------------------------------------------
    */
    'table_prefix' => '',

    /*
    |--------------------------------------------------------------------------
    | Nomes das tabelas
    |--------------------------------------------------------------------------
    */
    'table_name_menus' => 'menus',
    'table_name_items' => 'menu_items',

    /*
    |--------------------------------------------------------------------------
    | Rota base de gerenciamento
    |--------------------------------------------------------------------------
    */
    'route_path' => '/menu',

    /*
    |--------------------------------------------------------------------------
    | Funções para itens de menu
    |--------------------------------------------------------------------------
    */
    'use_roles' => false,

    /*
    |--------------------------------------------------------------------------
    | Usando use_roles = true acima, defina o nome da tabela
    |--------------------------------------------------------------------------
    */
    'roles_table' => 'roles',

    'roles_pk' => 'id', // Chave primária da tabela roles
    'roles_title_field' => 'name', // Nome de exibição (campo) da tabela de roles

    'jquery_show' => false, // false ou true
    'jquery_toastr_show' => false, //  false ou true
    'jquery_link' => 'https://cdnjs.cloudflare.com/ajax/libs/jquery/3.5.1/jquery.min.js',
    'notifications_custom_show' => true,
    'notifications_custom_var' => 'wmenu::notifications',
];
